app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages"  WHERE "pages"."slug" = 'stranitsa2-0082d1b1-789a-46c7-bc8a-df2127ade22b' LIMIT 1
---
  def update
    @page = Page.find_by_slug(params[:id])

SELECT  "pages".* FROM "pages"  WHERE "pages"."path" = '1' LIMIT 1
---
  def destroy
    @page = Page.find_by_path(get_path(params[:path]))

SELECT  "pages".* FROM "pages"  WHERE "pages"."path" = 'страница1' LIMIT 1
---
    def set_page
      path = get_path(params[:path])
      @page = Page.find_by_path(path)