app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("body", "created_at", "name", "path", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["body", "тест"], ["created_at", "2015-04-24 08:35:18.852835"], ["name", "страница1"], ["path", "1"], ["slug", "1"], ["title", "страница1"], ["updated_at", "2015-04-24 08:35:18.852835"]]

  def update
    respond_to do |format|
      if @page.update(page_params)
---
UPDATE "pages" SET "name" = ?, "parent_id" = ?, "path" = ?, "title" = ?, "updated_at" = ? WHERE "pages"."id" = 3  [["name", "Лук_"], ["parent_id", 3], ["path", "/страница100/страница2/Лук/Лук_"], ["title", "майонез"], ["updated_at", "2015-04-24 14:53:28.844134"]]

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 2]]